[
  {
    "title": "Festember 2025: Dates Announced for the Golden Jubilee Edition",
    "slug": "festember-2025-dates-announced",
    "category": "Hostel",
    "description": "NIT Trichy's flagship cultural festival is back with a bang. Here is everything you need to know about the upcoming golden jubilee celebration.",
    "content": "<p><strong>Festember</strong>, the annual cultural festival of the National Institute of Technology, Tiruchirappalli, is all set to return this September for its <strong>Golden Jubilee Edition</strong>.</p><h2>What to Expect?</h2><p>This year, the theme is <em>'Timeless Treasures'</em>, celebrating 50 years of art, culture, and music. The organizing committee has promised a lineup of international artists, 60+ workshops, and the classic Pro-Shows that keep the crowd on their feet.</p><blockquote>&quot;It's not just a fest; it's an emotion for every NITTian.&quot; - Student Council President</blockquote><h3>Key Events</h3><ul><li><strong>Choreo Nite:</strong> The best dance crews in South India face off.</li><li><strong>Gigahertz:</strong> The ultimate rock band battle.</li><li><strong>Shruthilaya:</strong> Classical music fusion.</li></ul><p>Stay tuned for the official ticket release next week!</p>",
    "image": "https://images.unsplash.com/photo-1459749411177-287ce3274392?auto=format&fit=crop&w=1200&q=80"
  },
  {
    "title": "NITT Retains Top 10 Spot in NIRF Rankings 2024",
    "slug": "nitt-retains-top-10-nirf-2024",
    "category": "StudentLife",
    "description": "National Institute of Technology, Tiruchirappalli continues its streak of excellence by securing the 9th rank in the Engineering category.",
    "content": "<p>The <strong>National Institutional Ranking Framework (NIRF)</strong> released its 2024 rankings today, and <strong>NIT Trichy</strong> has once again proved its mettle by retaining the <strong>9th position</strong> in the Engineering category nationwide.</p><p>This makes NITT the undisputed leader among all NITs for the 8th consecutive year. The ranking is based on parameters such as:</p><ol><li>Teaching, Learning &amp; Resources</li><li>Research and Professional Practice</li><li>Graduation Outcomes</li><li>Outreach and Inclusivity</li></ol><p>The Director congratulated the faculty, staff, and students for their relentless hard work and research contributions.</p>",
    "image": "https://images.unsplash.com/photo-1562774053-701939374585?auto=format&fit=crop&w=1200&q=80"
  },
  {
    "title": "Pragyan '25: Call for Innovations",
    "slug": "pragyan-25-call-for-innovations",
    "category": "Hostel",
    "description": "The ISO 9001:2015 certified techno-managerial fest of NIT Trichy opens registrations for its flagship innovation challenge.",
    "content": "<p><strong>Pragyan</strong>, the student-run tech fest of NIT Trichy, has officially opened registrations for <em>'Sangam'</em> and <em>'Ingenious'</em>, its flagship hardware and software hackathons.</p><h2>Theme: The Singularity</h2><p>With AI taking center stage in the global narrative, this year's Pragyan will focus on Human-AI collaboration. Students from colleges across India are invited to present prototypes that solve real-world problems.</p><p><strong>Prize Pool:</strong> INR 5 Lakhs.<br><strong>Deadline:</strong> October 15th, 2024.</p><p>Visit the official Pragyan website to register your team today.</p>",
    "image": "https://images.unsplash.com/photo-1517077304055-6e89abbf09b0?auto=format&fit=crop&w=1200&q=80"
  },
  {
    "title": "The Ultimate Guide to Hostels: Garnet, Opal & Aquamarine",
    "slug": "ultimate-guide-to-hostels-garnet-opal",
    "category": "Hostel",
    "description": "Moving into campus? Here is a survival guide to the hostel blocks, mess food, and late-night canteens.",
    "content": "<p>Hostel life is the heart of the NITT experience. Whether you are a fresher moving into <strong>Agate</strong> or a senior chilling in <strong>Garnet</strong>, every block has its own vibe.</p><h3>Hostel Must-Haves</h3><ul><li><strong>Extension Box:</strong> Power sockets are gold.</li><li><strong>Kettle:</strong> For that 2 AM Maggi.</li><li><strong>Cycle:</strong> The campus is huge (800 acres!).</li></ul><h3>Mess Food Review</h3><p>While the Mega Mess offers variety, nothing beats the midnight parottas at the night canteen near Amber. If you are in Opal, the Nescafe kiosk is your savior for morning lectures.</p>",
    "image": "https://images.unsplash.com/photo-1555854877-bab0e564b8d5?auto=format&fit=crop&w=1200&q=80"
  },
  {
    "title": "5 Best Study Spots on Campus for Finals Week",
    "slug": "5-best-study-spots-nitt",
    "category": "Department",
    "description": "Library full? Here are the quietest hidden gems around campus to get your work done.",
    "content": "<p>With end-semester exams approaching, finding a quiet spot can be a challenge. We scouted the 800-acre campus to find the best places for deep work.</p><h2>1. The Octagon Computer Center</h2><p>Air-conditioned and open 24/7. Perfect for coding marathons, though it can get chilly at night.</p><h2>2. Orion Staircases</h2><p>Surprisingly quiet during non-class hours and offers a great breeze.</p><h2>3. The State Bank Road</h2><p>Ideally not for studying books, but great for walking discussions and clearing your mind before an exam.</p>",
    "image": "https://images.unsplash.com/photo-1434030216411-0b793f4b4173?auto=format&fit=crop&w=1200&q=80"
  },
  {
    "title": "New Startup Incubator Launched at CEDI",
    "slug": "cedi-startup-incubator-launch",
    "category": "HostelLife",
    "description": "Center for Entrepreneurship Development and Incubation (CEDI) announces funding for student-led startups.",
    "content": "<p>The <strong>Center for Entrepreneurship Development and Incubation (CEDI)</strong> at NIT Trichy has announced a new seed fund of INR 2 Crores to support student startups.</p><p>The initiative aims to foster a culture of entrepreneurship among engineering students. Selected startups will receive:</p><ul><li>Office space within the CEDI building.</li><li>Mentorship from alumni industry leaders.</li><li>Cloud credits and legal support.</li></ul><p>Applications are open for the Winter Cohort 2025.</p>",
    "image": "https://images.unsplash.com/photo-1519389950473-47ba0277781c?auto=format&fit=crop&w=1200&q=80"
  }
]